#language: ru
Функционал: Озон

  Сценарий: Закидывание в корзину нечетных телефонов

  Когда выбрана вкладка "Электроника"
    
  Когда выбран девайс "Телефоны"

  Когда выбран брэнд "Apple"
  Когда выбрана нижняя граница цены "20000"
  Когда добавлены товары

  Когда перешли в корзину

  Тогда все выбранные девайсы есть в корзине

  Когда удалили все
  Тогда корзина пуста


  Сценарий: Закидывание в корзину нечетных фотоаппаратов

  Когда выбрана вкладка "Электроника"

  Когда выбран девайс "Зеркальные фотоаппараты"

  Когда выбран брэнд "Nikon, Canon"
  Когда выбрана нижняя граница цены "25000"
  Когда добавлены товары

  Когда перешли в корзину

  Тогда все выбранные девайсы есть в корзине

  Когда удалили все
  Тогда корзина пуста

